btn set P0.0	;підключення кнопки до порту P0.0
led set P0.1 ;підключення лампочки до порту P0.1
Count set R1 ;присвоєння змінної Count до регістру  R1

A00:  ;ім'я мітки
 clr led ;очищення індикатора
	jb btn,A01 ;перехід на мітку А01, якщо змінна btn в логічній одиниці (кнопка натиснута)
	jnb btn,A00 ;перехід на мітку А00, якщо змінна btn в логічному 0 (кнопка не натиснута)

A01:    setb led ;встановлення змінної led в лог. 1 (світиться лампочка)
	mov Count,#2 ;запис у змінну Count значення 2
	call A03 ;виклик мітки А03
	nop ;пуста команда
	nop
	jmp A00 ;перехід на мітку А00
A03:
	nop
	nop
	djnz Count,A03 ;перехід на мітку А03 і декремент на кожному переході, доки змінна Count не буде =0
	nop
	ret ;вихід з підпрограми

